In [8]:
import pandas as pd
df = pd.read_csv("train.csv")
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [9]:
df.shape

(891, 12)

In [10]:
df.drop(["PassengerId","Name","SibSp","Parch","Ticket","Cabin","Embarked"],axis="columns",inplace=True)
df.head()

   Survived  Pclass     Sex   Age     Fare
0         0       3    male  22.0   7.2500
1         1       1  female  38.0  71.2833
2         1       3  female  26.0   7.9250
3         1       1  female  35.0  53.1000
4         0       3    male  35.0   8.0500

In [21]:
target = df.Survived
inputs = df.drop("Survived",axis="columns")

In [22]:
dummies = pd.get_dummies(inputs.Sex)
dummies.head()

   female  male
0       0     1
1       1     0
2       1     0
3       1     0
4       0     1

In [23]:
inputs = pd.concat([inputs,dummies],axis="columns")
inputs.head()

   Pclass     Sex   Age     Fare  female  male
0       3    male  22.0   7.2500       0     1
1       1  female  38.0  71.2833       1     0
2       3  female  26.0   7.9250       1     0
3       1  female  35.0  53.1000       1     0
4       3    male  35.0   8.0500       0     1

In [24]:
inputs.drop("Sex",axis="columns",inplace=True)

In [25]:
inputs.head()

   Pclass   Age     Fare  female  male
0       3  22.0   7.2500       0     1
1       1  38.0  71.2833       1     0
2       3  26.0   7.9250       1     0
3       1  35.0  53.1000       1     0
4       3  35.0   8.0500       0     1

In [27]:
inputs.columns[inputs.isna().any()]  #  to check if any col has "na" values

Index(['Age'], dtype='object')

In [28]:
inputs.Age[:10]

0    22.0
1    38.0
2    26.0
3    35.0
4    35.0
5     NaN
6    54.0
7     2.0
8    27.0
9    14.0
Name: Age, dtype: float64

In [29]:
inputs.Age = inputs.Age.fillna(inputs.Age.mean())
inputs.Age[:10]

0    22.000000
1    38.000000
2    26.000000
3    35.000000
4    35.000000
5    29.699118
6    54.000000
7     2.000000
8    27.000000
9    14.000000
Name: Age, dtype: float64

In [37]:
from sklearn.model_selection import train_test_split
X_train,X_test,y_train,y_test = train_test_split(inputs,target,test_size=0.2)

In [38]:
len(X_test)

179

In [39]:
from sklearn.naive_bayes import GaussianNB
model = GaussianNB()

model.fit(X_train,y_train)
model.score(X_test,y_test)

0.8100558659217877

In [40]:
X_test[0:10]

     Pclass        Age      Fare  female  male
311       1  18.000000  262.3750       1     0
626       2  57.000000   12.3500       0     1
674       2  29.699118    0.0000       0     1
552       3  29.699118    7.8292       0     1
525       3  40.500000    7.7500       0     1
394       3  24.000000   16.7000       1     0
444       3  29.699118    8.1125       0     1
129       3  45.000000    6.9750       0     1
656       3  29.699118    7.8958       0     1
564       3  29.699118    8.0500       1     0

In [41]:
y_test[0:10]

311    1
626    0
674    0
552    0
525    0
394    1
444    1
129    0
656    0
564    0
Name: Survived, dtype: int64

In [42]:
model.predict(X_test[0:10])

array([1, 0, 0, 0, 0, 1, 0, 0, 0, 1], dtype=int64)

In [44]:
model.predict_proba(X_test[:10])   # not survived | survived

array([[2.16677189e-12, 1.00000000e+00],
       [9.69478604e-01, 3.05213964e-02],
       [9.73546844e-01, 2.64531562e-02],
       [9.87798655e-01, 1.22013447e-02],
       [9.88189899e-01, 1.18101008e-02],
       [6.52646819e-02, 9.34735318e-01],
       [9.87818699e-01, 1.21813013e-02],
       [9.87714336e-01, 1.22856637e-02],
       [9.87803434e-01, 1.21965663e-02],
       [6.91259227e-02, 9.30874077e-01]])